brew "bat"
brew "fontconfig"
brew "chezmoi"
brew "eza"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "glow"
brew "isync", restart_service: :changed
brew "librsvg"
brew "mdcat"
brew "msmtp"
brew "ncdu"
brew "neomutt"
brew "oauth2l"
brew "pandoc"
brew "poppler"
brew "ripgrep"
brew "starship"
brew "surfer"
brew "tiger-vnc"
brew "tmux"
brew "uv"
brew "wireguard-tools"
brew "zoxide"
cask "basictex"
cask "chatgpt"
cask "claude-code"
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
cask "github"
cask "iterm2"
cask "itermai"
cask "joplin"
cask "karabiner-elements"
cask "macvim-app"
cask "qutebrowser"
cask "rectangle"
cask "tigervnc-viewer"
cask "visual-studio-code"
vscode "chipsalliance.verible"
vscode "davidanson.vscode-markdownlint"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "mshr-h.veriloghdl"
vscode "vscodevim.vim"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
