brew "bat"
brew "chezmoi"
brew "eza"
brew "fontconfig"
brew "fzf"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "zoxide"
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
cask "itermai"
cask "macvim-app"
cask "visual-studio-code"
